/* 고객의 보유여부 및 가입순서 추출 */

SELECT 기준일자
     , 고객번호
     , 고객유형코드
     , 수신_보유여부
     , 수신_보통예금_보유여부
     , 수신_정기적금_보유여부
     , 수신_정기예금_보유여부
     , 수신_입출금통장_보유여부
     , 수신_주택청약저축_보유여부
     , 수신_개인IRP_보유여부
     , 수신_10년적금_보유여부
     , 수신_자유적금_보유여부
     , 여신_보유여부
     , 여신_마이너스통장_보유여부
     , 여신_신용대출_보유여부
     , 여신_중저신용대출_보유여부
     , 여신_전월세보증금대출_보유여부
     , 여신_주택담보대출_보유여부
     , 카드_보유여부
     , 개인카드_보유여부
     , 법인카드_보유여부
     , 체크카드_보유여부
     , 신용카드_보유여부
     , 카드_사용여부
     , 카드_현금_이용여부
     , 카드_일시불_이용여부
     , 카드_할부_이용여부
     , 서비스_이용여부
     , 서비스_내신용정보_이용여부
     , 서비스_개인IRP_이용여부
     , 서비스_해외송금_이용여부
     , 서비스_타사계좌연결_이용여부
     , 서비스_자동이체_이용여부
     , 수신만보유_여부
     , 여신만보유_여부
     , 카드만보유_여부
     , 수신여신보유_여부
     , 수신카드보유_여부
     , 여신카드보유_여부
     , 수신여신카드보유_여부
     , 수신_가입순번
     , 여신_가입순번
     , 카드_가입순번
     , 전체상품가입순서
  FROM 고객별상품실적현황
 WHERE 기준일자 = :기준변수일자
   -- AND 고객번호 = :고객번호   /* 특정 고객 조회 시 */
 ORDER BY 기준일자
        , 고객번호
;
