-- ================================================================
-- 계좌연속거래마스터 적재 쿼리
-- :기준변수일자  - 변수날짜를 기준일자로 적재
-- 해당 기준일자 DELETE 후 적재
-- ================================================================

DELETE FROM 계좌연속거래마스터
WHERE 기준일자 = :기준변수일자
;

INSERT INTO 계좌연속거래마스터
(
  기준일자
, 수신여신구분코드
, 계약번호
, 고객번호
, 상품코드
, 계좌상태코드
, 계좌잔액
, 신규일자
, 만기일자
, 연속거래일수
, 연속거래여부
, 적재일시
)

WITH 거래일자잔액 AS (

----- 수신 거래 일자별 마감잔액 -----

SELECT '01'                               AS 수신여신구분코드
     , A.계약번호                          AS 계약번호
     , B.신규일자                          AS 신규일자
     , COALESCE( A.기산일자, A.거래일자 )   AS 거래기준일자
     , A.거래후잔액                        AS 거래후잔액
     , ROW_NUMBER() OVER ( PARTITION BY A.계약번호, COALESCE( A.기산일자, A.거래일자 )
                               ORDER BY A.거래시각 DESC, A.거래일련번호 DESC
                         )         AS RN
  FROM 수신거래내역 A
 INNER JOIN 수신계좌 B
    ON A.계약번호 = B.계약번호
   AND B.수신계좌상태코드 = '01'   /* 01 : 정상 */
 WHERE A.거래상태코드 = '01'  -- 정상거래만
   AND COALESCE(A.기산일자, A.거래일자) <= :기준변수일자

UNION ALL

------ 여신 거래 일자별 마감잔액 -----

SELECT '02'                              AS 수신여신구분코드
     , A.계약번호                          AS 계약번호
     , B.신규일자                          AS 신규일자
     , COALESCE( A.기산일자, A.거래일자 )   AS 거래기준일자
     , A.거래후잔액                        AS 거래후잔액
     , ROW_NUMBER() OVER ( PARTITION BY A.계약번호, COALESCE( A.기산일자, A.거래일자 )
                               ORDER BY A.거래시각 DESC, A.거래일련번호 DESC
                         )         AS RN
  FROM 여신거래내역 A
 INNER JOIN 여신계좌 B
    ON A.계약번호 = B.계약번호
   AND B.여신계좌상태코드 = '01'   /* 01 : 정상 */
 WHERE A.거래상태코드 = '01'  -- 정상거래만
   AND COALESCE(A.기산일자, A.거래일자) <= :기준변수일자

)

, 일별최종거래 AS (   -- 일자 마지막 거래건만

SELECT 수신여신구분코드
     , 계약번호
     , 신규일자
     , 거래기준일자      AS 최종거래일자
     , 거래후잔액        AS 일마감잔액
  FROM 거래일자잔액
 WHERE RN = 1

)

/* 수신 연속거래여부 구하기 - 잔액이 0원 이상이 되는 최초 날짜 구하기 */
, 연속여부일자 AS (

SELECT 수신여신구분코드
     , 계약번호
     , MAX( CASE WHEN 일마감잔액 <= 0 THEN 최종거래일자
                 ELSE '00000000'
            END ) AS 연속여부시작일자   /* 연속 거래 기준 시작일자 찾기 */
  FROM 일별최종거래
 GROUP BY 수신여신구분코드
        , 계약번호

)

/* 수신 연속거래여부 구하기 - 수신거래내역 잔액 0원 이상인 시작 거래일자 구하기 */

, 계좌연속거래 AS (

SELECT A.수신여신구분코드
     , A.계약번호

     , ( TO_DATE( :기준변수일자, 'YYYYMMDD' ) - TO_DATE( MIN( A.최종거래일자 ) , 'YYYYMMDD' ) ) + 1  AS 연속일수

  FROM 일별최종거래 A

 INNER JOIN 연속여부일자 B
    ON A.수신여신구분코드 = B.수신여신구분코드
   AND A.계약번호 = B.계약번호

 WHERE A.일마감잔액 > 0   /* 여신도 0원 이상이면 사용한다고 가정 - 마이너스 통장 등 업무 정의 필요 */
   AND A.최종거래일자 > B.연속여부시작일자

 GROUP BY A.수신여신구분코드
        , A.계약번호

)

, 수신여신계좌연속마스터 AS (

/* 수신계좌기준 30일 이상 연속거래여부 붙이기 */

SELECT '01'             AS 수신여신구분코드
     , A.계약번호
     , A.고객번호
     , A.상품코드
     , A.수신계좌상태코드  AS 계좌상태코드
     , A.계좌잔액
     , A.신규일자
     , A.만기일자

     , COALESCE(B.연속일수, 0)  AS 연속거래일수
     , CASE WHEN COALESCE(B.연속일수, 0) >= 30 THEN 'Y'
            ELSE 'N'
       END   AS 연속거래여부

  FROM 수신계좌 A
  LEFT OUTER JOIN 계좌연속거래 B
    ON B.수신여신구분코드 = '01'   /* 01 : 수신 */
   AND A.계약번호 = B.계약번호
 WHERE A.수신계좌상태코드 = '01'   /* 01 : 정상 */

UNION ALL

/* 여신계좌기준 30일 이상 연속거래여부 붙이기 */

SELECT '02'             AS 수신여신구분코드
     , A.계약번호
     , A.고객번호
     , A.상품코드
     , A.여신계좌상태코드  AS 계좌상태코드
     , A.계좌잔액
     , A.신규일자
     , A.만기일자

     , COALESCE(B.연속일수, 0)  AS 연속거래일수
     , CASE WHEN COALESCE(B.연속일수, 0) >= 30 THEN 'Y'
            ELSE 'N'
       END   AS 연속거래여부

  FROM 여신계좌 A
  LEFT OUTER JOIN 계좌연속거래 B
    ON B.수신여신구분코드 = '02'   /* 02 : 여신 */
   AND A.계약번호 = B.계약번호
 WHERE A.여신계좌상태코드 = '01'   /* 01 : 정상 */

)

SELECT :기준변수일자  AS 기준일자
     , 수신여신구분코드
     , 계약번호
     , 고객번호
     , 상품코드
     , 계좌상태코드
     , 계좌잔액
     , 신규일자
     , 만기일자
     , 연속거래일수
     , 연속거래여부
     , CURRENT_TIMESTAMP  AS 적재일시
  FROM 수신여신계좌연속마스터

;
